OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/SRC_UVC/uvc_ctrl.c
/*
 *      uvc_ctrl.c  --  USB Video Class driver - Controls
 *
 *      Copyright (C) 2005-2010
 *          Laurent Pinchart (laurent.pinchart@ideasonboard.com)
 *
 *      This program is free software; you can redistribute it and/or modify
 *      it under the terms of the GNU General Public License as published by
 *      the Free Software Foundation; either version 2 of the License, or
 *      (at your option) any later version.
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "nuc970.h"
#include "sys.h"
#include "usb.h"
#include "usbh_lib.h"
#include "linux_uvc_fake.h"

#define UVC_CTRL_DATA_CURRENT	0
#define UVC_CTRL_DATA_BACKUP	1
#define UVC_CTRL_DATA_MIN	2
#define UVC_CTRL_DATA_MAX	3
#define UVC_CTRL_DATA_RES	4
#define UVC_CTRL_DATA_DEF	5
#define UVC_CTRL_DATA_LAST	6

/* ------------------------------------------------------------------------
 * Controls
 */

static struct uvc_control_info uvc_ctrls[] = {
	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 0, UVC_PU_BRIGHTNESS_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },
	
	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 1, UVC_PU_CONTRAST_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 2, UVC_PU_HUE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE	| UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 3, UVC_PU_SATURATION_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 4, UVC_PU_SHARPNESS_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 5, UVC_PU_GAMMA_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 6, UVC_PU_WHITE_BALANCE_TEMPERATURE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 7, UVC_PU_WHITE_BALANCE_COMPONENT_CONTROL, 4, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE },
			
	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 8, UVC_PU_BACKLIGHT_COMPENSATION_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 9, UVC_PU_GAIN_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 10, UVC_PU_POWER_LINE_FREQUENCY_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 11, UVC_PU_HUE_AUTO_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 12, UVC_PU_WHITE_BALANCE_TEMPERATURE_AUTO_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 13, UVC_PU_WHITE_BALANCE_COMPONENT_AUTO_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 14, UVC_PU_DIGITAL_MULTIPLIER_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE },

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 15, UVC_PU_DIGITAL_MULTIPLIER_LIMIT_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 16, UVC_PU_ANALOG_VIDEO_STANDARD_CONTROL, 1, 
			UVC_CTRL_FLAG_GET_CUR }, 

	{ NULL,NULL, UVC_GUID_UVC_PROCESSING, 17, UVC_PU_ANALOG_LOCK_STATUS_CONTROL, 1, 
			UVC_CTRL_FLAG_GET_CUR }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 0, UVC_CT_SCANNING_MODE_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 1, UVC_CT_AE_MODE_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_GET_RES | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 2, UVC_CT_AE_PRIORITY_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 3, UVC_CT_EXPOSURE_TIME_ABSOLUTE_CONTROL, 4, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 4, UVC_CT_EXPOSURE_TIME_RELATIVE_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 5, UVC_CT_FOCUS_ABSOLUTE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 6, UVC_CT_FOCUS_RELATIVE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_MIN | UVC_CTRL_FLAG_GET_MAX | UVC_CTRL_FLAG_GET_RES | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 7, UVC_CT_IRIS_ABSOLUTE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 8, UVC_CT_IRIS_RELATIVE_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_AUTO_UPDATE }, 
			
	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 9, UVC_CT_ZOOM_ABSOLUTE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 10, UVC_CT_ZOOM_RELATIVE_CONTROL, 3, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_MIN | UVC_CTRL_FLAG_GET_MAX | UVC_CTRL_FLAG_GET_RES | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 11, UVC_CT_PANTILT_ABSOLUTE_CONTROL, 8, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE	| UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 12, UVC_CT_PANTILT_RELATIVE_CONTROL, 4, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_MIN | UVC_CTRL_FLAG_GET_MAX | UVC_CTRL_FLAG_GET_RES | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_AUTO_UPDATE }, 
	
