OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/SRC_UVC/uvc_ctrl.c
	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 13, UVC_CT_ROLL_ABSOLUTE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_RANGE | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 14, UVC_CT_ROLL_RELATIVE_CONTROL, 2, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_MIN | UVC_CTRL_FLAG_GET_MAX | UVC_CTRL_FLAG_GET_RES | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_AUTO_UPDATE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 17, UVC_CT_FOCUS_AUTO_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_GET_DEF | UVC_CTRL_FLAG_RESTORE }, 

	{ NULL,NULL, UVC_GUID_UVC_CAMERA, 18, UVC_CT_PRIVACY_CONTROL, 1, 
			UVC_CTRL_FLAG_SET_CUR | UVC_CTRL_FLAG_GET_CUR | UVC_CTRL_FLAG_RESTORE | UVC_CTRL_FLAG_AUTO_UPDATE }
};

static struct uvc_menu_info power_line_frequency_controls[] = {
	{ 0, "Disabled" },
	{ 1, "50 Hz" },
	{ 2, "60 Hz" },
};

static struct uvc_menu_info exposure_auto_controls[] = {
	{ 2, "Auto Mode" },
	{ 1, "Manual Mode" },
	{ 4, "Shutter Priority Mode" },
	{ 8, "Aperture Priority Mode" },
};

static __s32 uvc_ctrl_get_zoom(struct uvc_control_mapping *mapping,
	__u8 query, const __u8 *data)
{
	__s8 zoom = (__s8)data[0];

	switch (query) {
	case UVC_GET_CUR:
		return (zoom == 0) ? 0 : (zoom > 0 ? data[2] : -data[2]);

	case UVC_GET_MIN:
	case UVC_GET_MAX:
	case UVC_GET_RES:
	case UVC_GET_DEF:
	default:
		return data[2];
	}
}

static void uvc_ctrl_set_zoom(struct uvc_control_mapping *mapping,
	__s32 value, __u8 *data)
{
	data[0] = value == 0 ? 0 : (value > 0) ? 1 : 0xff;
	data[2] = min((int)abs(value), 0xff);
}

static struct uvc_control_mapping uvc_ctrl_mappings[] = {
	{ NULL,NULL, NULL, V4L2_CID_BRIGHTNESS, "Brightness", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_BRIGHTNESS_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_CONTRAST, "Contrast", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_CONTRAST_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_HUE, "Hue", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_HUE_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_SATURATION, "Saturation", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_SATURATION_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_SHARPNESS, "Sharpness", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_SHARPNESS_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_GAMMA, "Gamma", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_GAMMA_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_BACKLIGHT_COMPENSATION, "Backlight Compensation", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_BACKLIGHT_COMPENSATION_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_GAIN, "Gain", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_GAIN_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_POWER_LINE_FREQUENCY, "Power Line Frequency", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_POWER_LINE_FREQUENCY_CONTROL, 2, 0, V4L2_CTRL_TYPE_MENU, UVC_CTRL_DATA_TYPE_ENUM, 
		power_line_frequency_controls, sizeof(power_line_frequency_controls)/sizeof(struct uvc_menu_info), NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_HUE_AUTO, "Hue, Auto", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_HUE_AUTO_CONTROL, 1, 0, V4L2_CTRL_TYPE_BOOLEAN, UVC_CTRL_DATA_TYPE_BOOLEAN, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_EXPOSURE_AUTO, "Exposure, Auto", UVC_GUID_UVC_CAMERA, 
		UVC_CT_AE_MODE_CONTROL, 4, 0, V4L2_CTRL_TYPE_MENU, UVC_CTRL_DATA_TYPE_BITMASK, 
		exposure_auto_controls, sizeof(exposure_auto_controls)/sizeof(struct uvc_menu_info), NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_EXPOSURE_AUTO_PRIORITY, "Exposure, Auto Priority", UVC_GUID_UVC_CAMERA, 
		UVC_CT_AE_PRIORITY_CONTROL, 1, 0, V4L2_CTRL_TYPE_BOOLEAN, UVC_CTRL_DATA_TYPE_BOOLEAN, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_EXPOSURE_ABSOLUTE, "Exposure (Absolute)", UVC_GUID_UVC_CAMERA, 
		UVC_CT_EXPOSURE_TIME_ABSOLUTE_CONTROL, 32, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_AUTO_WHITE_BALANCE, "White Balance Temperature, Auto", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_WHITE_BALANCE_TEMPERATURE_AUTO_CONTROL, 1, 0, V4L2_CTRL_TYPE_BOOLEAN, UVC_CTRL_DATA_TYPE_BOOLEAN, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_WHITE_BALANCE_TEMPERATURE, "White Balance Temperature", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_WHITE_BALANCE_TEMPERATURE_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_AUTO_WHITE_BALANCE, "White Balance Component, Auto", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_WHITE_BALANCE_COMPONENT_AUTO_CONTROL, 1, 0, V4L2_CTRL_TYPE_BOOLEAN, UVC_CTRL_DATA_TYPE_BOOLEAN, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_BLUE_BALANCE, "White Balance Blue Component", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_WHITE_BALANCE_COMPONENT_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_RED_BALANCE, "White Balance Red Component", UVC_GUID_UVC_PROCESSING, 
		UVC_PU_WHITE_BALANCE_COMPONENT_CONTROL, 16, 16, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_FOCUS_ABSOLUTE, "Focus (absolute)", UVC_GUID_UVC_CAMERA, 
		UVC_CT_FOCUS_ABSOLUTE_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_FOCUS_AUTO, "Focus, Auto", UVC_GUID_UVC_CAMERA, 
		UVC_CT_FOCUS_AUTO_CONTROL, 1, 0, V4L2_CTRL_TYPE_BOOLEAN, UVC_CTRL_DATA_TYPE_BOOLEAN, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_IRIS_ABSOLUTE, "Iris, Absolute", UVC_GUID_UVC_CAMERA, 
		UVC_CT_IRIS_ABSOLUTE_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_IRIS_RELATIVE, "Iris, Relative", UVC_GUID_UVC_CAMERA, 
		UVC_CT_IRIS_RELATIVE_CONTROL, 8, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_ZOOM_ABSOLUTE, "Zoom, Absolute", UVC_GUID_UVC_CAMERA, 
		UVC_CT_ZOOM_ABSOLUTE_CONTROL, 16, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_UNSIGNED, 
		NULL, 0, NULL, NULL },

	{ NULL,NULL, NULL, V4L2_CID_ZOOM_CONTINUOUS, "Zoom, Continuous", UVC_GUID_UVC_CAMERA, 
		UVC_CT_ZOOM_RELATIVE_CONTROL, 0, 0, V4L2_CTRL_TYPE_INTEGER, UVC_CTRL_DATA_TYPE_SIGNED, 
		NULL, 0, uvc_ctrl_get_zoom, uvc_ctrl_set_zoom },

