OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/SRC_UVC/uvc_ctrl.c
	return 0;
}

int uvc_ctrl_add_mapping(struct uvc_video_chain *chain,
	const struct uvc_control_mapping *mapping)
{
	struct uvc_device *dev = chain->dev;
	struct uvc_control_mapping *map;
	struct uvc_entity *entity;
	struct uvc_control *ctrl;
	int found = 0;
	int ret;

	if (mapping->id & ~V4L2_CTRL_ID_MASK) {
		UVC_ERROR("Can't add mapping '%s', control "
			"id 0x%08x is invalid.\n", mapping->name,
			mapping->id);
		return -EINVAL;
	}

	/* Search for the matching (GUID/CS) control on the current chain */
#ifdef NUVOTON_PORTED
	for (entity = list_entry((&chain->entities)->next, struct uvc_entity, chain);
	     &entity->chain != (&chain->entities);
	     entity = list_entry(entity->chain.next, struct uvc_entity, chain)) {
#else
	list_for_each_entry(entity, &chain->entities, chain) {
#endif		
		unsigned int i;

		if (UVC_ENTITY_TYPE(entity) != UVC_VC_EXTENSION_UNIT ||
		    !uvc_entity_match_guid(entity, mapping->entity))
			continue;

		for (i = 0; i < entity->ncontrols; ++i) {
			ctrl = &entity->controls[i];
			if (ctrl->index == mapping->selector - 1) {
				found = 1;
				break;
			}
		}

		if (found)
			break;
	}
	if (!found)
		return -ENOENT;

	//if (mutex_lock_interruptible(&chain->ctrl_mutex))
	//	return -ERESTARTSYS;

	/* Perform delayed initialization of XU controls */
	ret = uvc_ctrl_init_xu_ctrl(dev, ctrl);
	if (ret < 0) {
		ret = -ENOENT;
		goto done;
	}

#ifdef NUVOTON_PORTED
	for (map = list_entry((&ctrl->info.mappings)->next, struct uvc_control_mapping, list);
	     &map->list != (&ctrl->info.mappings);
	     map = list_entry(map->list.next, struct uvc_control_mapping, list)) {
#else
	list_for_each_entry(map, &ctrl->info.mappings, list) {
#endif		
		if (mapping->id == map->id) {
			UVC_ERROR("Can't add mapping '%s', "
				"control id 0x%08x already exists.\n",
				mapping->name, mapping->id);
			ret = -1; // -EEXIST;
			goto done;
		}
	}

	/* Prevent excess memory consumption */
	//if (atomic_inc_return(&dev->nmappings) > UVC_MAX_CONTROL_MAPPINGS) {
	//	atomic_dec(&dev->nmappings);
	//	UVC_ERROR("Can't add mapping '%s', maximum "
	//		"mappings count (%u) exceeded.\n", mapping->name,
	//		UVC_MAX_CONTROL_MAPPINGS);
	//	ret = -ENOMEM;
	//	goto done;
	//}

	ret = __uvc_ctrl_add_mapping(dev, ctrl, mapping);
	if (ret < 0)
		atomic_dec(&dev->nmappings);

done:
	//mutex_unlock(&chain->ctrl_mutex);
	return ret;
}

/*
 * Prune an entity of its bogus controls using a blacklist. Bogus controls
 * are currently the ones that crash the camera or unconditionally return an
 * error when queried.
 */
static void uvc_ctrl_prune_entity(struct uvc_device *dev,
	struct uvc_entity *entity)
{
	struct uvc_ctrl_blacklist {
		struct usb_device_id id;
		u8 index;
	};

	static const struct uvc_ctrl_blacklist processing_blacklist[] = {
		{ USB_DEVICE(0x13d3, 0x509b) , 9 }, /* Gain */
		{ USB_DEVICE(0x1c4f, 0x3000) , 6 }, /* WB Temperature */
		{ USB_DEVICE(0x5986, 0x0241) , 2 }, /* Hue */
	};
	static const struct uvc_ctrl_blacklist camera_blacklist[] = {
		{ USB_DEVICE(0x06f8, 0x3005) , 9 }, /* Zoom, Absolute */
	};

	const struct uvc_ctrl_blacklist *blacklist;
	unsigned int size;
	unsigned int count;
	unsigned int i;
	u8 *controls;

	switch (UVC_ENTITY_TYPE(entity)) {
	case UVC_VC_PROCESSING_UNIT:
		blacklist = processing_blacklist;
		count = sizeof(processing_blacklist)/sizeof(struct uvc_ctrl_blacklist);
		controls = entity->u.processing.bmControls;
		size = entity->u.processing.bControlSize;
		break;

	case UVC_ITT_CAMERA:
		blacklist = camera_blacklist;
		count = sizeof(camera_blacklist)/sizeof(struct uvc_ctrl_blacklist);
		controls = entity->u.camera.bmControls;
		size = entity->u.camera.bControlSize;
		break;

	default:
		return;
	}

	for (i = 0; i < count; ++i) {
		if (!usb_match_one_id(dev->intf, &blacklist[i].id))
			continue;

		if (blacklist[i].index >= 8 * size ||
		    !uvc_test_bit(controls, blacklist[i].index))
			continue;

		UVC_INFO("%u/%u control is black listed, removing it.\n", entity->id, blacklist[i].index);

		uvc_clear_bit(controls, blacklist[i].index);
	}
}

/*
 * Add control information and hardcoded stock control mappings to the given
 * device.
 */
static void uvc_ctrl_init_ctrl(struct uvc_device *dev, struct uvc_control *ctrl)
{
	const struct uvc_control_info *info = uvc_ctrls;
	const struct uvc_control_info *iend = info + (sizeof(uvc_ctrls)/sizeof(struct uvc_control_info));
	const struct uvc_control_mapping *mapping = uvc_ctrl_mappings;
	const struct uvc_control_mapping *mend =
		mapping + (sizeof(uvc_ctrl_mappings)/sizeof(struct uvc_control_mapping));

	/* XU controls initialization requires querying the device for control
	 * information. As some buggy UVC devices will crash when queried
	 * repeatedly in a tight loop, delay XU controls initialization until
	 * first use.
	 */
	if (UVC_ENTITY_TYPE(ctrl->entity) == UVC_VC_EXTENSION_UNIT)
		return;

	for (; info < iend; ++info) {
		if (uvc_entity_match_guid(ctrl->entity, info->entity) &&
		    ctrl->index == info->index) {
			uvc_ctrl_add_info(dev, ctrl, info);
			break;
		 }
	}

	if (!ctrl->initialized)
		return;

	for (; mapping < mend; ++mapping) {
		if (uvc_entity_match_guid(ctrl->entity, mapping->entity) &&
		    ctrl->info.selector == mapping->selector)
			__uvc_ctrl_add_mapping(dev, ctrl, mapping);
	}
}


/* from /lib/hweight.c */
static unsigned int  hweight8(unsigned int w)
{
	unsigned int res = w - ((w >> 1) & 0x55);
	res = (res & 0x33) + ((res >> 2) & 0x33);
	return (res + (res >> 4)) & 0x0F;
}


/*
 * Initialize device controls.
 */
int uvc_ctrl_init_device(struct uvc_device *dev)
{
	struct uvc_entity *entity;
	unsigned int i;

	/* Walk the entities list and instantiate controls */
#ifdef NUVOTON_PORTED
	for (entity = list_entry((&dev->entities)->next, struct uvc_entity, list);
	     &entity->list != (&dev->entities);
	     entity = list_entry(entity->list.next, struct uvc_entity, list)) {
#else
	list_for_each_entry(entity, &dev->entities, list) {
#endif		
		struct uvc_control *ctrl;
		unsigned int bControlSize = 0, ncontrols = 0;
		__u8 *bmControls = NULL;

		if (UVC_ENTITY_TYPE(entity) == UVC_VC_EXTENSION_UNIT) {
			bmControls = entity->u.extension.bmControls;
			bControlSize = entity->u.extension.bControlSize;
		} else if (UVC_ENTITY_TYPE(entity) == UVC_VC_PROCESSING_UNIT) {
			bmControls = entity->u.processing.bmControls;
			bControlSize = entity->u.processing.bControlSize;
		} else if (UVC_ENTITY_TYPE(entity) == UVC_ITT_CAMERA) {
			bmControls = entity->u.camera.bmControls;
			bControlSize = entity->u.camera.bControlSize;
		}

		/* Remove bogus/blacklisted controls */
		uvc_ctrl_prune_entity(dev, entity);

