OpenNuvoton/NUC970_NonOS_BSP/Library/USB_HOST/SRC_UVC/uvc_ctrl.c
		/* Count supported controls and allocate the controls array */
		for (i = 0; i < bControlSize; ++i)
			ncontrols += hweight8(bmControls[i]);
		if (ncontrols == 0)
			continue;

		entity->controls = kzalloc(ncontrols * sizeof(*ctrl),
					   GFP_KERNEL);
		if (entity->controls == NULL)
			return -ENOMEM;
		entity->ncontrols = ncontrols;

		/* Initialize all supported controls */
		ctrl = entity->controls;
		for (i = 0; i < bControlSize * 8; ++i) {
			if (uvc_test_bit(bmControls, i) == 0)
				continue;

			ctrl->entity = entity;
			ctrl->index = i;

			uvc_ctrl_init_ctrl(dev, ctrl);
			ctrl++;
		}
	}

	return 0;
}

/*
 * Cleanup device controls.
 */
static void uvc_ctrl_cleanup_mappings(struct uvc_device *dev,
	struct uvc_control *ctrl)
{
	struct uvc_control_mapping *mapping, *nm;

#ifdef NUVOTON_PORTED
	for (mapping = list_entry((&ctrl->info.mappings)->next, struct uvc_control_mapping, list),
		nm = list_entry(mapping->list.next, struct uvc_control_mapping, list);
	     &mapping->list != (&ctrl->info.mappings); 
	     mapping = nm, nm = list_entry(nm->list.next, struct uvc_control_mapping, list)) {
#else	     
	list_for_each_entry_safe(mapping, nm, &ctrl->info.mappings, list) {
#endif		
		list_del(&mapping->list);
		kfree(mapping->menu_info);
		kfree(mapping);
	}
}

void uvc_ctrl_cleanup_device(struct uvc_device *dev)
{
	struct uvc_entity *entity;
	unsigned int i;

	/* Free controls and control mappings for all entities. */
#ifdef NUVOTON_PORTED
	for (entity = list_entry((&dev->entities)->next, struct uvc_entity, list);
	     &entity->list != (&dev->entities);
	     entity = list_entry(entity->list.next, struct uvc_entity, list)) {
#else
	list_for_each_entry(entity, &dev->entities, list) {
#endif		
		for (i = 0; i < entity->ncontrols; ++i) {
			struct uvc_control *ctrl = &entity->controls[i];

			if (!ctrl->initialized)
				continue;

			uvc_ctrl_cleanup_mappings(dev, ctrl);
			kfree(ctrl->uvc_data);
		}

		kfree(entity->controls);
	}
}
